NorthernMan54/ESP32_Display_Panel/src/lv_port.c
    assert(disp_cfg != NULL);
    assert(disp_cfg->io_handle != NULL);
    assert(disp_cfg->panel_handle != NULL);
    assert(disp_cfg->buffer_size > 0);
    assert(disp_cfg->hres > 0);
    assert(disp_cfg->vres > 0);

    /* Display context */
    lvgl_port_display_ctx_t *disp_ctx = malloc(sizeof(lvgl_port_display_ctx_t));
    ESP_GOTO_ON_FALSE(disp_ctx, ESP_ERR_NO_MEM, err, TAG, "Not enough memory for display context allocation! %d", sizeof(lvgl_port_display_ctx_t));
    disp_ctx->io_handle = disp_cfg->io_handle;
    disp_ctx->panel_handle = disp_cfg->panel_handle;
    disp_ctx->trans_size = disp_cfg->trans_size;
    disp_ctx->sw_rotate = disp_cfg->sw_rotate;
    disp_ctx->draw_wait_cb = disp_cfg->draw_wait_cb;

    uint32_t buff_caps = MALLOC_CAP_DEFAULT;
    if (disp_cfg->flags.buff_dma)
    {
        buff_caps = MALLOC_CAP_DMA;
    }
    else if (disp_cfg->flags.buff_spiram)
    {
        buff_caps = MALLOC_CAP_SPIRAM;
    }

    /* alloc draw buffers used by LVGL */
    /* it's recommended to choose the size of the draw buffer(s) to be at least 1/10 screen sized */
    buf1 = heap_caps_malloc(disp_cfg->buffer_size * sizeof(lv_color_t), buff_caps);
    ESP_GOTO_ON_FALSE(buf1, ESP_ERR_NO_MEM, err, TAG, "Not enough memory for LVGL buffer (buf1) allocation! %d", disp_cfg->buffer_size * sizeof(lv_color_t));

    if (disp_ctx->trans_size)
    {

        uint32_t caps = MALLOC_CAP_DMA;

        // buf2 = heap_caps_malloc(disp_ctx->trans_size * sizeof(lv_color_t), caps);

        buf2 = heap_caps_malloc(disp_cfg->buffer_size * sizeof(lv_color_t), buff_caps);
        ESP_GOTO_ON_FALSE(buf2, ESP_ERR_NO_MEM, err, TAG, "Not enough memory for buffer2(transport) allocation! %d", disp_cfg->buffer_size * sizeof(lv_color_t));
        disp_ctx->trans_buf_1 = buf2;

        buf3 = heap_caps_malloc(disp_cfg->buffer_size * sizeof(lv_color_t), buff_caps);
        ESP_GOTO_ON_FALSE(buf3, ESP_ERR_NO_MEM, err, TAG, "Not enough memory for buffer3(transport) allocation! %d", disp_cfg->buffer_size * sizeof(lv_color_t));
        disp_ctx->trans_buf_2 = buf3;

        trans_done_sem = xSemaphoreCreateCounting(1, 0);
        ESP_GOTO_ON_FALSE(trans_done_sem, ESP_ERR_NO_MEM, err, TAG, "Failed to create transport counting Semaphore");
        disp_ctx->trans_done_sem = trans_done_sem;
    }

    // lv_disp_draw_buf_t *disp_buf = malloc(sizeof(lv_disp_draw_buf_t));
    // ESP_GOTO_ON_FALSE(disp_buf, ESP_ERR_NO_MEM, err, TAG, "Not enough memory for LVGL display buffer allocation!");

    /* initialize LVGL draw buffers */
    // lv_disp_draw_buf_init(disp_buf, buf1, NULL, disp_cfg->buffer_size);

    lv_display_t *display = lv_display_create(disp_cfg->hres, disp_cfg->vres);
    lv_display_set_flush_cb(display, lvgl_port_flush_callback);
    lv_display_set_buffers(display, buf1, buf2, disp_cfg->buffer_size * sizeof(lv_color_t), LV_DISPLAY_RENDER_MODE_PARTIAL);

    ESP_LOGE(TAG, "Register display driver to LVGL buf1 %p, buf2 %p, buf3 %p", buf1, disp_ctx->trans_buf_1, disp_ctx->trans_buf_2);
    ESP_LOGE(TAG, "Register display driver to LVGL size %d", disp_cfg->buffer_size * sizeof(lv_color_t));
    ESP_LOGE(TAG, "Register display driver to LVGL trans_size %d", disp_ctx->trans_size * sizeof(lv_color_t));
    ESP_LOGD(TAG, "Register display driver to LVGL");

    //   ESP_LOGE(TAG, "Board: %s", BOARD_NAME);
    //   ESP_LOGE(TAG, "CPU: %s rev%d, CPU Freq: %d Mhz, %d core(s)", ESP.getChipModel(), ESP.getChipRevision(), getCpuFrequencyMhz(), ESP.getChipCores());
    ESP_LOGE(
        TAG,
        "Free Heap: %u bytes\n"
        "  MALLOC_CAP_8BIT      %7zu bytes\n"
        "  MALLOC_CAP_DMA       %7zu bytes\n"
        "  MALLOC_CAP_SPIRAM    %7zu bytes\n"
        "  MALLOC_CAP_INTERNAL  %7zu bytes\n"
        "  MALLOC_CAP_DEFAULT   %7zu bytes\n"
        "  MALLOC_CAP_IRAM_8BIT %7zu bytes\n"
        "  MALLOC_CAP_RETENTION %7zu bytes\n",
        xPortGetFreeHeapSize(),
        heap_caps_get_free_size(MALLOC_CAP_8BIT),
        heap_caps_get_free_size(MALLOC_CAP_DMA),
        heap_caps_get_free_size(MALLOC_CAP_SPIRAM),
        heap_caps_get_free_size(MALLOC_CAP_INTERNAL),
        heap_caps_get_free_size(MALLOC_CAP_DEFAULT),
        heap_caps_get_free_size(MALLOC_CAP_IRAM_8BIT),
        heap_caps_get_free_size(MALLOC_CAP_RETENTION));

    // lv_disp_drv_init(&disp_ctx->disp_drv);
    //    disp_ctx->disp_drv.hor_res = disp_cfg->hres;
    //    disp_ctx->disp_drv.ver_res = disp_cfg->vres;
    //    disp_ctx->disp_drv.flush_cb = lvgl_port_flush_callback;

    //    disp_ctx->disp_drv.draw_buf = display;
    //    disp_ctx->disp_drv.user_data = disp_ctx;
    /* Force full_fresh */
    //    disp_ctx->disp_drv.full_refresh = 1;

#if LVGL_PORT_HANDLE_FLUSH_READY
    /* Register done callback */
    const esp_lcd_panel_io_callbacks_t cbs = {
        .on_color_trans_done = lvgl_port_flush_ready_callback,
    };
    esp_lcd_panel_io_register_event_callbacks(disp_ctx->io_handle, &cbs, &disp_ctx->disp_drv);
#endif

    lv_display_set_user_data(display, &disp_ctx);
    // disp = lv_disp_drv_register(&disp_ctx->disp_drv);

err:
    if (ret != ESP_OK)
    {
        if (buf1)
        {
            free(buf1);
        }
        if (buf2)
        {
            free(buf2);
        }
        if (buf3)
        {
            free(buf3);
        }
        if (trans_done_sem)
        {
            vSemaphoreDelete(trans_done_sem);
        }
        if (disp_ctx)
        {
            free(disp_ctx);
        }
    }

    return display;
}

esp_err_t lvgl_port_remove_disp(lv_display_t *disp)
{
    assert(disp);

    //    lv_display_t *disp_drv = disp->driver;
    //   assert(disp_drv);
    lvgl_port_display_ctx_t *disp_ctx = (lvgl_port_display_ctx_t *)lv_display_get_user_data(disp);
    /*
            lv_disp_remove(disp);

            if (disp_drv)
            {
                if (disp_drv->draw_buf && disp_drv->draw_buf->buf1)
                {
                    free(disp_drv->draw_buf->buf1);
                    disp_drv->draw_buf->buf1 = NULL;
                }
                if (disp_drv->draw_buf && disp_drv->draw_buf->buf2)
                {
                    free(disp_drv->draw_buf->buf2);
                    disp_drv->draw_buf->buf2 = NULL;
                }
                if (disp_drv->draw_buf)
                {
                    free(disp_drv->draw_buf);
                    disp_drv->draw_buf = NULL;
                }
            }
    */
    free(disp_ctx);
    lv_display_delete(disp);
    return ESP_OK;
}

#ifdef ESP_LVGL_PORT_TOUCH_COMPONENT
lv_indev_t *lvgl_port_add_touch(const lvgl_port_touch_cfg_t *touch_cfg)
{
    assert(touch_cfg != NULL);
    assert(touch_cfg->disp != NULL);
    assert(touch_cfg->handle != NULL);

    lv_indev_t *indev = lv_indev_create();
    lv_indev_set_type(indev, LV_INDEV_TYPE_POINTER);
    lv_indev_set_read_cb(indev, lvgl_port_touchpad_read);

    /* Touch context */
    lvgl_port_touch_ctx_t *touch_ctx = malloc(sizeof(lvgl_port_touch_ctx_t));
    if (touch_ctx == NULL)
    {
        ESP_LOGE(TAG, "Not enough memory for touch context allocation!");
        return NULL;
    }
    touch_ctx->handle = touch_cfg->handle;
    touch_ctx->touch_wait_cb = touch_cfg->touch_wait_cb;

    /* Register a touchpad input device */
    // lv_indev_drv_init(&touch_ctx->indev_drv);
    // touch_ctx->indev_drv.type = LV_INDEV_TYPE_POINTER;
    // touch_ctx->indev_drv.disp = touch_cfg->disp;
    // touch_ctx->indev_drv.read_cb = lvgl_port_touchpad_read;
    // touch_ctx->indev_drv.user_data = touch_ctx;

    lv_indev_set_user_data(indev, touch_ctx);
    return indev;
}

