NorthernMan54/ESP32_Display_Panel/src/lv_port.c
            disp_ctx->trans_act = (disp_ctx->trans_act == disp_ctx->trans_buf_1) ? (disp_ctx->trans_buf_2) : (disp_ctx->trans_buf_1);
            to = disp_ctx->trans_act;

            ESP_LOGE(TAG, "LV_DISPLAY_ROTATION_0 to %p", to);
            if (to != NULL)
            {
                ESP_LOGE(TAG, "To target not set");
            }
            else
            {
                switch (rotate)
                {
                case LV_DISPLAY_ROTATION_90:
                    for (int y = 0; y < height; y++)
                    {
                        for (int x = 0; x < trans_width; x++)
                        {
                            *(to + x * height + (height - y - 1)) = *(from + y * width + x_start_tmp + x);
                        }
                    }

                    x_draw_start = lv_display_get_vertical_resolution(drv) - y_end - 1;
                    x_draw_end = lv_display_get_vertical_resolution(drv) - y_start - 1;
                    y_draw_start = x_start_tmp;
                    y_draw_end = x_end_tmp;
                    break;
                case LV_DISPLAY_ROTATION_270:
                    for (int y = 0; y < height; y++)
                    {
                        for (int x = 0; x < trans_width; x++)
                        {
                            *(to + (trans_width - x - 1) * height + y) = *(from + y * width + x_start_tmp + x);
                        }
                    }
                    x_draw_start = y_start;
                    x_draw_end = y_end;
                    y_draw_start = lv_display_get_horizontal_resolution(drv) - x_end_tmp - 1;
                    y_draw_end = lv_display_get_horizontal_resolution(drv) - x_start_tmp - 1;
                    break;
                case LV_DISPLAY_ROTATION_180:
                    for (int y = 0; y < trans_height; y++)
                    {
                        for (int x = 0; x < width; x++)
                        {
                            *(to + (trans_height - y - 1) * width + (width - x - 1)) = *(from + y_start_tmp * width + y * (width) + x);
                        }
                    }
                    x_draw_start = lv_display_get_horizontal_resolution(drv) - x_end - 1;
                    x_draw_end = lv_display_get_horizontal_resolution(drv) - x_start - 1;
                    y_draw_start = lv_display_get_vertical_resolution(drv) - y_end_tmp - 1;
                    y_draw_end = lv_display_get_vertical_resolution(drv) - y_start_tmp - 1;
                    break;
                case LV_DISPLAY_ROTATION_0:
                    ESP_LOGE(TAG, "LV_DISPLAY_ROTATION_0 %d %d %d ", trans_height, width, y_start_tmp);
                    for (int y = 0; y < trans_height; y++)
                    {
                        for (int x = 0; x < width; x++)
                        {
                            *(to + y * (width) + x) = *(from + y_start_tmp * width + y * (width) + x);
                        }
                    }
                    x_draw_start = x_start;
                    x_draw_end = x_end;
                    y_draw_start = y_start_tmp;
                    y_draw_end = y_end_tmp;
                    break;
                default:
                    break;
                }

                if (0 == i)
                {
                    if (disp_ctx->draw_wait_cb)
                    {
                        disp_ctx->draw_wait_cb(disp_ctx->panel_handle->user_data);
                    }
                    xSemaphoreGive(disp_ctx->trans_done_sem);
                }

                xSemaphoreTake(disp_ctx->trans_done_sem, portMAX_DELAY);
                esp_lcd_panel_draw_bitmap(disp_ctx->panel_handle, x_draw_start, y_draw_start, x_draw_end + 1, y_draw_end + 1, to);

                if (LV_DISPLAY_ROTATION_90 == rotate)
                {
                    x_start_tmp += max_width;
                }
                else if (LV_DISPLAY_ROTATION_270 == rotate)
                {
                    x_end_tmp -= max_width;
                }
                if (LV_DISPLAY_ROTATION_0 == rotate)
                {
                    y_start_tmp += max_height;
                }
                else
                {
                    y_end_tmp -= max_height;
                }
            }
        }
    }
    else
    {
        esp_lcd_panel_draw_bitmap(disp_ctx->panel_handle, x_start, y_start, x_end + 1, y_end + 1, color_map);
    }
    lv_disp_flush_ready(drv);
}

#ifdef ESP_LVGL_PORT_TOUCH_COMPONENT
static void lvgl_port_touchpad_read(lv_indev_t *indev_drv, lv_indev_data_t *data)
{
    assert(indev_drv);
    lvgl_port_touch_ctx_t *touch_ctx = (lvgl_port_touch_ctx_t *)lv_indev_get_user_data(indev_drv);
    assert(touch_ctx->handle);

    uint16_t touchpad_x[1] = {0};
    uint16_t touchpad_y[1] = {0};
    uint8_t touchpad_cnt = 0;

    /* Read data from touch controller into memory */
    bool touch_int = false;
    if (touch_ctx->touch_wait_cb)
    {
        touch_int = touch_ctx->touch_wait_cb(touch_ctx->handle->config.user_data);
    }
    if (touch_int)
    {
        esp_lcd_touch_read_data(touch_ctx->handle);
        /* Read data from touch controller */
        bool touchpad_pressed = esp_lcd_touch_get_coordinates(touch_ctx->handle, touchpad_x, touchpad_y, NULL, &touchpad_cnt, 1);

        if (touchpad_pressed && touchpad_cnt > 0)
        {
            data->point.x = touchpad_x[0];
            data->point.y = touchpad_y[0];
            data->state = LV_INDEV_STATE_PRESSED;
            esp_rom_printf("Touchpad pressed: x=%d, y=%d\n", data->point.x, data->point.y);
        }
        else
        {
            data->state = LV_INDEV_STATE_RELEASED;
        }
    }
}
#endif

static void lvgl_port_tick_increment(void *arg)
{
    /* Tell LVGL how many milliseconds have elapsed */
    lv_tick_inc(lvgl_port_timer_period_ms);
}

static esp_err_t lvgl_port_tick_init(void)
{
    // Tick interface for LVGL (using esp_timer to generate 2ms periodic event)
    const esp_timer_create_args_t lvgl_tick_timer_args = {
        .callback = &lvgl_port_tick_increment,
        .name = "LVGL tick",
    };
    ESP_RETURN_ON_ERROR(esp_timer_create(&lvgl_tick_timer_args, &lvgl_port_ctx.tick_timer), TAG, "Creating LVGL timer filed!");
    return esp_timer_start_periodic(lvgl_port_ctx.tick_timer, lvgl_port_timer_period_ms * 1000);
}
